; domain
(define (domain Perestroika)
(:requirements :typing :equality)
(:types location resource - object
        
)

(:predicates (at-agent ?l - location)
             (connected ?l1 ?l2 - location)
             (at-res ?r - resource ?l - location)
             (taken ?r - resource)
             (accessible ?l - location)
             (alive)
             (dead)
             (solid ?l - location)
             (big ?l - location)
             (medium ?l - location)
             (small ?l - location)
             (none ?l - location)   
             (act-round)

            ; (dup-accessible ?l - location)
)

(:action move
:parameters (?l1 ?l2 - location)
:precondition (and (at-agent ?l1)
                   (alive)
                   (connected ?l1 ?l2)
                   (accessible ?l2)
                  ; (dup-accessible ?l2)
              )
:effect (and (not (at-agent ?l1))
             (at-agent ?l2)
        )
)

(:action collect
:parameters (?r - resource ?l - location)
:precondition (and (at-agent ?l)
                   (at-res ?r ?l)
                   (alive)
              )
:effect (and (taken ?r)
        )
)


)

; problem
(define (problem Perestroika-problem)
(:domain Perestroika)
(:objects r1 r2 r3 r4 - resource
          l-1-1 l-1-2 l-1-3 l-2-1 l-2-2 l-2-3 l-3-1 l-3-2 l-3-3 - location
)

(:init (act-round)
       (alive)
       (at-agent l-1-1)
       (at-res r1 l-1-3)
       (at-res r2 l-3-3)
       (at-res r3 l-3-1)
      
(connected l-1-1 l-2-1)
(connected l-2-1 l-1-1)
(connected l-1-1 l-1-2)
(connected l-1-2 l-1-1)
(connected l-1-2 l-2-2)
(connected l-2-2 l-1-2)
(connected l-1-2 l-1-3)
(connected l-1-3 l-1-2)
(connected l-1-3 l-2-3)
(connected l-2-3 l-1-3)
(connected l-2-1 l-3-1)
(connected l-3-1 l-2-1)
(connected l-2-1 l-2-2)
(connected l-2-2 l-2-1)
(connected l-2-2 l-3-2)
(connected l-3-2 l-2-2)
(connected l-2-2 l-2-3)
(connected l-2-3 l-2-2)
(connected l-2-3 l-3-3)
(connected l-3-3 l-2-3)
(connected l-3-1 l-3-2)
(connected l-3-2 l-3-1)
(connected l-3-2 l-3-3)
(connected l-3-3 l-3-2)

(accessible l-1-1)
(solid l-1-1)
(accessible l-1-2)
(medium l-1-2)
(accessible l-1-3)
(solid l-1-3)
(accessible l-2-1)
(big l-2-1)
(accessible l-2-2)
(solid l-2-2)
(accessible l-2-3)
(small l-2-3)
(accessible l-3-1)
(solid l-3-1)
(accessible l-3-2)
(small l-3-2)
(accessible l-3-3)
(solid l-3-3)

)

(:goal (and (alive)
            (taken r1)
            (taken r2)
            (taken r3)
        )
)
)

; plan
1. (move l-1-1 l-1-2)
   deleted: (at-agent l-1-1)
   added: (at-agent l-1-2)
   goals met: 1 of 4
2. (move l-1-2 l-1-3)
   deleted: (at-agent l-1-2)
   added: (at-agent l-1-3)
   goals met: 1 of 4
3. (collect r1 l-1-3)
   added: (taken r1)
   goals met: 2 of 4
4. (move l-1-3 l-2-3)
   deleted: (at-agent l-1-3)
   added: (at-agent l-2-3)
   goals met: 2 of 4
5. (move l-2-3 l-2-2)
   deleted: (at-agent l-2-3)
   added: (at-agent l-2-2)
   goals met: 2 of 4
6. (move l-2-2 l-2-1)
   deleted: (at-agent l-2-2)
   added: (at-agent l-2-1)
   goals met: 2 of 4
7. (move l-2-1 l-3-1)
   deleted: (at-agent l-2-1)
   added: (at-agent l-3-1)
   goals met: 2 of 4
8. (collect r3 l-3-1)
   added: (taken r3)
   goals met: 3 of 4
9. (move l-3-1 l-3-2)
   deleted: (at-agent l-3-1)
   added: (at-agent l-3-2)
   goals met: 3 of 4
10. (move l-3-2 l-3-3)
   deleted: (at-agent l-3-2)
   added: (at-agent l-3-3)
   goals met: 3 of 4
11. (collect r2 l-3-3)
   added: (taken r2)
   goals met: 4 of 4
